[
	{"Name": "Ирина Ремизова","Company": "Куратор аналитиков, Спортмастер Лаб","Photo": "remizova.jpg","Title": "«-Есть проблема? - Нет проблем!» Инструменты принятия решений.","Description": "<p>В нашей жизни нам приходится постоянно принимать разные решения. Их важность и сложность мы не всегда осознаем, поскольку не можем предусмотреть все возможные последствия. Поэтому нередко наши решения оказываются ошибочными и не приводят нас к желаемому результату. А мы не любим ошибаться! Ощущаем острую потребность принимать правильные решения и никогда не жалеть о выборе.</p><p>В данном докладе Ирина расскажет о методах, которые помогают ей. В легкой практике, отвечая на мои наводящие вопросы вы сможете научиться трем инструментам принятия решения. А если вы уже их знаете, попрактикуетесь, тем самым проработаете необходимые навыки мышления.</p>"},
	{"Name": "Александр Белькевич","Company": "Frontend-разработчик, Tripster","Photo": "belkevich.jpg","Title": "Сложности в современной frontend-разработке. Как не утонуть в болоте многообразия.","Description": "<p>Те, кто слышал про frontend разработку, но сам не сталкивался, думают, что это относительно просто. Тем не менее frontend развивается семимильными шагами и разработчики сталкиваются с множеством интересных и сложных задач. Кроме этого, количество новых технологий и практик растет как снежный ком каждый день и надо постоянно быть в тренде.</p><p>В данном докладе Александр расскажет, с какими сложностями сталкиваются frontend-разработчики и развеет мифы о том, что в этой области программирования легко.</p>"},
	{"Name": "Алексей Губин","Company": "Flutter-разработчик","Photo": "alex2.jpg","Title": "Неочевидная цена Flutter: за гранью красоты UI.","Description": "<p>Flutter предоставляет разработчикам обширные возможности для создания пользовательских интерфейсов, но даже незначительные изменения могут вызывать серьезные проблемы. В докладе мы подробно рассмотрим, что может замедлять ваше приложение и повышать расход батареи. Особое внимание будет уделено изучению процесса отрисовки UI в Flutter, включая основные инструменты и методики для визуализации и анализа этого процесса. Также будут продемонстрированы практические примеры оптимизации страниц и анимаций, показывающие, как эффективно решать распространенные проблемы в UI приложений на Flutter. Кроме того, будут освещены перспективные направления и возможности, которые Flutter предлагает для решения существующих, но пока неразрешенных проблем в отрисовке UI.</p>"},
	{"Name": "Роман Сергеев","Company": "Программист, ООО «ИТ-Центр»","Photo": "sergeev.jpg","Title": "Что наша жизнь - игра! Стартер-пак для разработчиков игр.","Description": "<p>Многие из студентов IT специальностей заинтересовались своей профессией благодаря компьютерным играм, многие мечтали стать частью этой индустрии, или даже создать собственные авторские проекты. Порой мечты рушатся о реальность, но в наших силах воплотить их в жизнь!</p><p>Мой доклад поможет вам узнать, как реализовать свою мечту и не остаться у разбитого корыта, какие есть инструменты для создания игр в наши дни, какие возможности и площадки есть, чтобы показать свой проект и найти заинтересованную целевую аудиторию, в каких чемпионатах и конкурсах можно принять участие. Также вы услышите о примерах, как «больших» и успешных авторах, так и о наших ближайших соотечественниках из Астрахани, пришедших к своей мечте, получите пошаговую инструкцию к действию. "},
	{"Name": "Валерий Лаптев","Company": "Программист, Digital Spirit","Photo": "laptev.png","Title": "Язык Go. Куда идем и зачем?","Description": "<p>Если языки программирования создаются, значит это кому-нибудь нужно. 15 лет назад был создан язык Go, в 2011 был опубликован первый релиз. Однако молодые программисты мало о нем знают. В обучении программированию он фактически отсутствует. Хотя во многих аспектах он гораздо лучше Питона, которым пичкают школьников на информатике. В докладе будут рассмотрены основные свойства языка, стандартная библиотека и стандартная инфраструктура разработки, показаны интересные отличия его от других современных языков и совместимость с языком Си.</p>"},
	{"Name": "Валерий Лаптев","Company": "Программист, Digital Spirit","Photo": "laptev.png","Title": "Кадры решают все. Кто виноват и что делать?","Description": "<p>Кадры решают все (с). Слова актуальны сегодня как никогда. В IT кадры решают все, всегда и по любому поводу. Однако острый недостаток квалифицированных разработчиков создает проблемы IT-бизнесу. По многочисленным оценкам сегодня в России не хватает до миллиона программистов. С уходом западных компаний с нашего рынка и необходимостью импортозамещения западного коммерческого ПО ситуация усугубляется. В докладе будут рассмотрены причины возникновения этой проблемы. Конкретная ситуация в Астраханской области. Предложены варианты решения проблемы нехватки кадров для ИТ-бизнеса.</p>"},
	{"Name": "Аделя Байрамгазиева","Company": "Системный аналитик, МТС Digital","Photo": "adelya.jpg","Title": "Не имей 100 рублей, а имей лояльного заказчика.","Description": "<p>Принято считать, что на успешность проекта влияют такие известные факторы как: сроки, бюджеты, управление рисками и т.д.</p><p>И гораздо реже упоминается один из немаловажных факторов, который сложно поддается оценке, однако, он может достаточно аффектить результаты проекта. Этот фактор – коммуникация с заказчиком, с командой.</p><p>В своем докладе я расскажу как выстроить гармоничные отношения с заказчиком, а также как поддерживать дружелюбную атмосферу в команде с коллегами, не уходя в апатию и депрессию.</p><p>Поделюсь своим опытом, а также познакомлю с практичными лайфхаками.</p>"},
	{"Name": "Федор Епишев","Company": "BackEnd разработчик, WAY11","Photo": "fedor.jpg","Title": "Конкурс некрасивого кода или к каким проблемам приводит чистый код.","Description": "<p>Федя из WAY11 расскажет о создании локальных стандартов написания кода внутри девопс-группы, чем чревато отсутствие общих парадигм написания у команды и почему жёсткие рамки написания чистого кода - это зло (иногда).</p>"},
	{"Name": "Александр Морозов","Company": "CTO, Adeptik","Photo": "alex.jpg","Title": "Заказчик vs разработчик. Единство и борьба противоположностей.","Description": "<p>Самый «традиционный» спикер devfest выступит на 5ой юбилейной конференции. Александр Морозов, технический директор компании Adeptik, поделится опытом проектирования и управления программными продуктами разного типа, сложности и назначения. </p> <p>Когда слушать заказчика, а когда убеждать? С решения каких вопросов стоит начинать создание продукта? Когда начинать писать код? На чем и с использованием чего писать? Если вы руководитель проекта, продукт менеджер, аналитик или архитектор и вам важно научиться правильно принимать решения о том, как, на чем и, самое главное, что писать - приходите на доклад.  25 лет опыта за 35 минут, возможность задать вопросы и подискутировать гарантированы.</p>"},

	{"Name": "Иван Храмцовский","Company": "Cистемный аналитик, ООО «НЛМК ИТ»","Photo": "ivan_hr.jpg","Title": "Системный анализ и его роль в проектировании. ","Description": "<p>Самые дорогие ошибки делают на этапе проектирования. Обсудим значение системного анализа и роли системного аналитика на ключевых этапах разработки программного обеспечения. Рассмотрим реальные примеры ошибок проектирования, которые привели к финансовым потерям компании и даже создали угрозу здоровью и жизни людей. Определим грань между системным и бизнес анализом, разберёмся почему системный аналитик часто совмещает обе роли.</p>"},
	{"Name": "Яна Седова","Company": "Лид-асессор поиска для разработчиков, Яндекс Крауд","Photo": "sedova.jpg","Title": "Плюсы и подводные камни Jetpack Compose.","Description": "<p>Модный фреймворк от Google позволяет в два счета написать современный UI с анимацией, навигацией, ленивой загрузкой и т.д. В докладе будут рассмотрены преимущества Jetpack Compose по сравнению с привычной XML-версткой. Кроме того, заглянем под капот фреймворка и поговорим о быстродействии. В конце посмотрим на реальный пример Android-приложения, работающего на Jetpack Compose.</p>"},
	{"Name": "Дамир Куаншалиев","Company": "Тест-менеджер, Digital Spirit","Photo": "kushaliev.jpg","Title": "Нагрузочное тестирование. Выжать максимум.","Description": "<p>Нагрузочное тестирование (НТ) - это не только подготовка скриптов и ddos сайтов. Это важный этап жизненного цикла развития высоконагруженных систем. В докладе рассмотрим, что из себя представляет нагрузочное тестирование, цели и события, которые приводят к необходимости проведения НТ и основные его этапы. </p> <p>Данный доклад позволит понять потребность проведения НТ в вашей работе, как встроить НТ в план работ и разговаривать со специалистами по НТ на одном языке</p>"}
]
